dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518_20161130/STM32F2xx_StdPeriph_Driver_v1212/src/stm32f2xx_usart5_1208.c
	RCC->__B.APB1ENR.UART5EN = ENABLE;
	
	__PC12_U5_TX(); 			// USART5_TX
	__PD2_U5_RX();				// USART5_RX

////////////////////////////////////////////////////////////////////////////////
	USART_InitStructure.USART_BaudRate = nBps;

	if( ((nLCR >> 4) & 0x01) ==  (_DATA8BIT >> 4)) {
			USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	}
	else	USART_InitStructure.USART_WordLength = USART_WordLength_9b;

////////////////////////////////////////////////////////////////////////////////
	if( ((nLCR >> 2) & 0x02) ==  (_05STOP >> 2)) {
		USART_InitStructure.USART_StopBits = USART_StopBits_0_5;
	}
	else if( ((nLCR >> 2) & 0x02) ==  (_1_STOP >> 2)) {
			USART_InitStructure.USART_StopBits = USART_StopBits_1;
	}
	else if( ((nLCR >> 2) & 0x02) ==  (_2_STOP >> 2)) {
			USART_InitStructure.USART_StopBits = USART_StopBits_2;
	}
	else	USART_InitStructure.USART_StopBits = USART_StopBits_1_5;
	
////////////////////////////////////////////////////////////////////////////////
	
	if(((nLCR >> 0) & 0x03) == (_NONPARITY >> 0)){
		USART_InitStructure.USART_Parity = USART_Parity_No;
	}
	else if(((nLCR >> 0) & 0x03) == (_ODDPARITY >> 0)){
		USART_InitStructure.USART_Parity = USART_Parity_Odd;
	}
	else{
		USART_InitStructure.USART_Parity = USART_Parity_Even;
	}
	
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	/* USART configuration */
	USART_Init(UART5, &USART_InitStructure);

#if defined (OS_INCLUDED) 
	pUSART5.sem = OSSemCreate(1);
#endif
	/* Enable USART */
	USART_Cmd(UART5, ENABLE);

	USART_ITConfig(UART5, USART_IT_RXNE, ENABLE);
	NVIC_Init(UART5_IRQn, ENABLE); 

	USART5Printf("\n");	
}

/*******************************************************************************
  * @brief  Interrupt handler USART5 global interrupt request
  * @param  None 
  * @retval None
  *****************************************************************************/
void USART5_IRQIntHandler(void)
{

	INT16U tmp = UART5->SR;

#ifdef OS_INCLUDED
	INT32U cpu_sr;
	CPU_CRITICAL_ENTER();                                       // Tell uC/OS-II that we are starting an ISR
	OSIntNesting++;
	CPU_CRITICAL_EXIT();
#endif /* OS_INCLUDED */
	// Rx Data Received
	if(tmp & ( 1 << __RXNE))
	{
		Rx5Buff[Rx5WrCnt%Rx5BuffLen] = UART5->DR;		// When the receive register is read, the RDR bit is automatically cleared.
		if(++Rx5WrCnt >= Rx5BuffLen) Rx5WrCnt = 0;
	}
	else if(tmp & ( 1 << __TXE))
	{
		if(Tx5RdCnt != Tx5WrCnt)
		{
			UART5->DR = Tx5Buff[Tx5RdCnt%Tx5BuffLen];
			if(++Tx5RdCnt >= Tx5BuffLen ) Tx5RdCnt = 0;
		}
		else UART5->__B.CR1.TXEIE = DISABLE;
	}
	else // error, dummy read
	{
		tmp =  UART5->DR;
	}

#ifdef OS_INCLUDED
	OSIntExit();												// Tell uC/OS-II that we are leaving the ISR
#endif /* OS_INCLUDED */

}

unsigned char USART5PutToBuffer(unsigned char Data)
{
#ifdef OS_INCLUDED
	INT8U err;
	//////////////////////////////////////////////////

	OSSemPend(pUSART5.sem, 0, &err);
#endif /* OS_INCLUDED */
	//////////////////////////////////////////////////
	Tx5Buff[Tx5WrCnt%Tx5BuffLen] = Data;
	if(++Tx5WrCnt >= Tx5BuffLen) Tx5WrCnt = 0;
	
	UART5->__B.CR1.TXEIE = ENABLE; 		
	///////////////////////////////////////////////////
#ifdef OS_INCLUDED
	OSSemPost(pUSART5.sem);
#endif /* OS_INCLUDED */

	return 0;
}



//Not using interrupt
unsigned char USART5PutChar(unsigned char Data)
{
	#ifdef OS_INCLUDED
		INT8U err;
		//////////////////////////////////////////////////
	
		OSSemPend(pUSART5.sem, 0, &err);
	#endif /* OS_INCLUDED */
		UART5->__B.DR.DR = Data;
		while(!UART5->__B.SR.TXE);
	#ifdef OS_INCLUDED
		OSSemPost(pUSART5.sem);
	#endif /* OS_INCLUDED */
	return Data;
}

unsigned long int USART5Printf( const char *format, ...)
{
	unsigned long int i, cnt;
	char buf[128];
	va_list argptr;

	va_start(argptr, format);
	cnt = vsprintf(buf, format, argptr);
	va_end( argptr );

	for(i = 0;;i++)
	{
		if(buf[i] == 0) break;
		if(buf[i] == '\n') USART5PutToBuffer('\r');
		USART5PutToBuffer(buf[i]);
	}
	while(!USART5TxCheckByte())
	{
#ifdef OS_INCLUDED
	OSTimeDly(1);
#endif /* OS_INCLUDED */
	}
	return cnt;
}

//#define OS_INCLUDED

void USART5PutStr(unsigned char *Str, unsigned short int Length, int iEn)
{
	u32 i = 0;

	USART5BuffClear();
	
#ifdef OS_INCLUDED
	INT8U err;
	OSSemPend(pUSART5.sem, 0, &err);
#endif /* OS_INCLUDED */


	for(i = 0; i < Length; i++)
	{
		Tx5Buff[Tx5WrCnt++] = Str[i];
		if(Tx5WrCnt >= Tx5BuffLen) Tx5WrCnt = 0;
	}

	if(iEn)
	{
		UART5->__B.CR1.TXEIE = ENABLE;
	}	
#ifdef OS_INCLUDED
		OSSemPost(pUSART5.sem);
#endif /* OS_INCLUDED */
}

signed short int USART5RxGetByte(void)
{
	s16 RetVal = 0;

#ifndef OS_INCLUDED
	while(Rx5RdCnt == Rx5WrCnt);
#else
	if(Rx5RdCnt == Rx5WrCnt) return -1;
#endif

	RetVal = Rx5Buff[Rx5RdCnt%Rx5BuffLen];
	if(++Rx5RdCnt >= Rx5BuffLen) Rx5RdCnt = 0;

	return (RetVal & 0xff);
}

unsigned char USART5CheckByte(unsigned short int ByteCnt, unsigned short int *Recv)
{
	u32 i = 0, j = 0;
	u8 RetVal = TRUE;

	*Recv = 0;
	i = (u32) Rx5RdCnt;
	j = (u32) Rx5WrCnt;

	if(i == j) RetVal = FALSE;
	else if(i < j)
	{
		*Recv = j - i;
		i = i + ByteCnt;
		if(i > j) RetVal = FALSE;
	}
	else if(i > j)
	{
		*Recv = (Rx5BuffLen +j) - i;
		i = i + ByteCnt;
		j = j + Rx5BuffLen;
		if(i > j) RetVal = FALSE; 
	}
	return (RetVal);
}

void USART5BuffClear(void)
{
	Rx5RdCnt = 0;
	Rx5WrCnt = 0;
	Tx5RdCnt = 0;
	Tx5WrCnt = 0;
}

void USART5TxClear(void)
{
	Tx5RdCnt = 0;
	Tx5WrCnt = 0;
}

/*******************************************************************************
  * @brief  if the bytes have been transmitted, retrun true or not
  * @param  None
  * @retval TRUE/FALSE
  ******************************************************************************/

signed short int USART5TxCheckByte(void)
{
	if(Tx5RdCnt == Tx5WrCnt) return TRUE;
	else return FALSE;
}




/**
  * @brief  Initializes the USARTx peripheral Clock according to the 
  *         specified parameters in the USART_ClockInitStruct .
  * @param  USARTx: where x can be 1, 2, 3 or 6 to select the USART peripheral.
  * @param  USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef structure that
  *         contains the configuration information for the specified  USART peripheral.
  * @note   The Smart Card and Synchronous modes are not available for UART4 and UART5.    
  * @retval None
  */

/**
  * @brief  Fills each USART_ClockInitStruct member with its default value.
  * @param  USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef structure
  *         which will be initialized.
  * @retval None
  */


/**
  * @brief  Enables or disables the specified USART peripheral.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USARTx peripheral.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */


/**
  * @brief  Sets the system clock prescaler.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  USART_Prescaler: specifies the prescaler clock. 
  * @note   The function is used for IrDA mode with UART4 and UART5.   
  * @retval None
  */

/**
  * @brief  Enables or disables the USART's 8x oversampling mode.
  * @note   This function has to be called before calling USART_Init() function
  *         in order to have correct baudrate Divider value.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USART 8x oversampling mode.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
  

/**
  * @brief  Enables or disables the USART's one bit sampling method.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USART one bit sampling method.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */

/**
  * @}
  */

